*** cryo-data.yaml

#+BEGIN_SRC bash :exports results :results verbatim
cat template/cryo-data.yaml
#+END_SRC

#+RESULTS:
#+begin_example
cryo_data_name: descriptive_name_or_path_clean_DOI
references:
  data:
    doi: nn.nnnn/nnn-nnn-nnnnn
    bib: |-
      @article{author_yyyy,
        doi = {nnn/nnn-nnnnn},
        year = {yyyy},
        month = nn,
        publisher = {Publisher},
        volume = {42},
        number = {42},
        pages = {42},
        author = {Last, First and Else, Someone}
        title = {{T}itle with {F}ormatting}},
        journal = {journal}
      }
  science:
    doi: nn.nnn/nnn-nnnn-nnnnnn
    bib:

aka:
  author: author_yyyy
  data_provider: name/dataset_id_or_doi
  organization: name/dataset_name
  project: dataset_name
  other:
#+end_example

*** cryo-data-download.{sh,py,ext}

A shell or python (or any other language) script that can call the appropriate datalad commands to download the data.

#+BEGIN_SRC bash :exports results :results verbatim
cat template/cryo-data-download.sh
#+END_SRC

#+RESULTS:
: #!/usr/bin/env bash
: 
: # can be more involved, e.g. wrapping download-url in a wget spyder
: # See also https://docs.datalad.org/en/stable/generated/man/datalad-addurls.html
: datalad download-url https://filesamples.com/samples/document/txt/sample1.txt

A more complicate example uses =wget= with login credentials to spider an NSIDC dataset with nested folders, then downloads each of the files preserving a specific folder level. The script is:
#+BEGIN_SRC bash
#!/usr/bin/env bash

# spider and save all output
wget --load-cookies ~/.urs_cookies --save-cookies ~/.urs_cookies --keep-session-cookies --no-check-certificate --auth-no-challenge=on -r -np -e robots=off --spider --force-html -nH --cut-dirs=2 https://n5eil01u.ecs.nsidc.org/MEASURES/NSIDC-0642.001/ > stdout.txt 2> stderr.txt

# Extract the URLs from the output, and the desired filename for each URL
echo "url,file" > urls.txt
for url in $(grep '^--' stderr.txt | awk '{ print $3 }' | grep -v '\(\/?\|\/$\)' | sort | uniq); do
  echo $url,$(echo $url| cut -d"/" -f6-) >> urls.txt
done

# import into datalad (--dry-run?)
datalad addurls --nosave --fast urls.txt '{url}' '{file}'

# cleanup
rm stderr.txt stdout.txt urls.txt
#+END_SRC

And the output of this is something like the following (here showing only =.shp= files for brevity)
#+begin_example
./2000.09.30/GlacierIDs_v01.2.shp
./2000.09.30/termini_0001_v01.2.shp
./2005.12.24/termini_0506_v01.2.shp
./2006.12.30/termini_0607_v01.2.shp
./2007.11.22/termini_0708_v01.2.shp
./2009.01.10/termini_0809_v01.2.shp
./2013.01.15/termini_1213_v01.2.shp
./2015.01.21/termini_1415_v01.2.shp
./2016.02.02/termini_1516_v01.2.shp
./2017.02.01/termini_1617_v01.2.shp
#+end_example



